Revit 2027 API
Connector.IsConnected Property
Identifies if the connector is physically connected to a connector on another element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsConnected { get; }
Public ReadOnly Property IsConnected As Boolean
	Get
public:
property bool IsConnected {
	bool get ();
}
member IsConnected : bool with get
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the connector's type is LogicalConn.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace